---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Field.ValueType
source: html/92146246-2bd5-4d84-98e7-ffda8b96b7a8.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field.ValueType Property

The type of the values stored in the field.

## Syntax (C#)
```csharp
public Type ValueType { get; }
```

## Remarks
For key-value maps, this is the value type.